//Дано число больше 9. Вывести на экран вторую цифру числа
int a=18946;
int b=a/10;
int c=a/10%10;
Console.WriteLine(b);
Console.WriteLine(c);    

